const container = document.querySelector(".container");

const badWords = [
  "пiдманула",
  "пiдвела",
  "понедiлок",
  "вiвторок",
  "середу",
  "четвер",
  "п’ятницю",
  "суботу",
  "недiлю",
];

const changeBadWords = (text) => {
  let newText = text;
  badWords.forEach((word) => {
    const regex = new RegExp(word, "gi");
    const stars = "*".repeat(word.length);
    newText = newText.replace(regex, stars);
  });
  return newText;
};

const text = `Ти казала в понедiлок – пiдем разом по барвiнок.

Я прийшов, тебе нема, пiдманула, пiдвела.

Ти ж мене пiдманула, ти ж мене пiдвела.

Ти ж мене, молодого, з ума розуму звела.

Я казала у вiвторок – поцiлую разiв сорок.

Ти прийшов, мене нема, пiдманула, пiдвела.

Я ж тебе пiдманула, я ж тебе пiдвела.

Я ж тебе, молодого, з ума розуму звела.

Ти казала у середу – пiдем разом по череду.

Я прийшов, тебе нема, пiдманула, пiдвела.

Ти ж мене пiдманула, ти ж мене пiдвела.

Ти ж мене, молодого, з ума розуму звела.

Я казала у четвер – пiдем разом на концерт.

Ти прийшов, мене нема, пiдманула, пiдвела.

Ти ж мене пiдманула, ти ж мене пiдвела.

Ти ж мене, молодого, з ума розуму звела.

Ти казала у п’ятницю – пiдем разом по пшеницю.

Я прийшов, тебе нема, пiдманула, пiдвела.

Я ж тебе пiдманула, ти ж мене пiдвела.

Ти ж його, молодого, з ума розуму звела.

Я казала у суботу – пiдем разом на роботу.

Я прийшов, тебе нема, пiдманула, пiдвела.

Я ж тебе пiдманула, ти ж мене пiдвела.

Ти ж його, молодого, з ума розуму звела.

Я казала у недiлю – пiдем разом на весiлля.

Я прийшов, тебе нема, пiдманула, пiдвела.

Ти ж мене пiдманула, ти ж мене пiдвела.

Ти ж мене, молодого, з ума розуму звела.`;

container.innerHTML = changeBadWords(text);
console.log(newText);